Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: The offset for timezones west of UTC is always negative, and for those east of UTC is always positive.
es: w - día de la semana, en número, de "0" (domingo) a "6 "(sábado)

source: The Z format will always return 0 when using gmdate().
es: Y - año, cuatro cifras; por ejemplo, "1999 "

source: ?php / / Prints something like:
es: y - año, dos cifras; por ejemplo, "99 "

source: Wednesday 15th of January 2003 05:51:38 AM echo date ("l dS of F Y h:i:s A"); / / Prints:
es: z - día del año; de "0 "a "365"

source: You can prevent a recognized character in the format string from being expanded by escaping it with a preceding backslash.
es: Z - diferencia horaria en segundos (de "-43200 "a "43200")

source: ?php / / prints something like:
es: Ejemplo de date()

source: It is possible to use date() and mktime() together to find dates in the future or the past.
es: print (date("l dS of F Y h:i:s A")); print ("July 1, 2000 is on a ". date("l", mktime(0,0,0,7,1,2000)));

source: ?php $tomorrow = mktime (0,0,0,date("m") ,date("d")+1,date("Y")); $lastmonth = mktime (0,0,0,date("m")-1,date("d"), date("Y")); $nextyear = mktime (0,0,0,date("m"), date("d"), date("Y")+1);?
es: Es posible usar date() y mktime() juntas para obtener fechas futuras o pasadas.

source: This can be more reliable than simply adding or subtracting the number of seconds in a day or month to a timestamp because of daylight savings time.
es: Ejemplo 2.

source: Some examples of date() Some examples of date() formatting.
es: Ejemplo de date() y mktime()

source: When escaping, be sure to use single quotes to prevent characters like \n from becoming newlines.
es: $tomorrow = mktime( 0,0,0,date("m") ,date("d")+1,date("Y")); $lastmonth = mktime(0,0,0,date("m")-1,date("d"), date("Y")); $nextyear = mktime(0,0,0,date("m"), date("d"), date("Y")+1);

source: ?php / / Assuming today is:
es: Para dar formato a fechas en otros idiomas, se deben usar las funciones setlocale() y strftime().

source: See also getlastmod(), gmdate(), mktime(), strftime() and time().
es: Ver también gmdate() y mktime().

source: dba_close() closes the established database and frees all resources specified by handle.
es: dba_close() cierra la conexion con una base de datos previamente abierta y libera todos los recursos especificados por handle.

source: handle is a database handle returned by dba_open().
es: handle es un manejador (handle) de la base de datos devuelto por dba_open().

source: dba_close() does not return any value.
es: dba_close() no devuelve ningun valor.

source: See also: dba_open() and dba_popen()
es: Ver tambien: dba_open() dba_popen()

source: dba_delete() deletes the entry specified by key from the database specified with handle.
es: dba_delete() borra la entrada especificada por key de la base de datos especificada por handle.

source: key is the key of the entry which is deleted.
es: key es la clave de la entrada que es borrada.

source: dba_delete() returns TRUE or FALSE, if the entry is deleted or not deleted, respectively.
es: dba_delete() devuelve TRUE o FALSE, si la entrada es borrada o no, respectivamente.

source: See also: dba_exists(), dba_fetch(), dba_insert(), and dba_replace().
es: Ver tambien: dba_exists() dba_fetch() dba_insert() dba_replace()

source: dba_exists() checks whether the specified key exists in the database specified by handle.
es: dba_exists() comprueba si la clave key existe en la base de datos especificada por handle.

source: Key is the key the check is performed for.
es: key es la clave para la que se realiza la comprobacion.

source: Handle is a database handle returned by dba_open().
es: handle es un manejador (handle) de la base de datos devuelto por dba_open().

source: dba_exists() returns TRUE or FALSE, if the key is found or not found, respectively.
es: dba_exists() devuelve TRUE o FALSE, si la clave es hallada o no, respectivamente.

source: See also: dba_fetch(), dba_delete(), dba_insert(), and dba_replace().
es: Ver tambien: dba_fetch() dba_delete() dba_insert() dba_replace()

source: Key is the key the data is specified by.
es: dba_fetch() extrae los datos especificados por la clave key de la base de datos determinada por handle.

source: Skip is the number of key-value pairs to ignore when using cdb databases.
es: key es la clave de la entrada de los datos que queremos extraer.

source: See also: dba_exists(), dba_delete(), dba_insert(), and dba_replace().
es: dba_fetch() devuelve la cadena asociada o FALSE, si el par key / data es hallado o no, respectivamente.

source: The skip parameter is available since PHP 4.3 to support cdb 's capability of multiple keys having the same name.
es: Ver tambien: dba_exists() dba_delete() dba_insert() dba_replace()

source: dba_firstkey() returns the first key of the database specified by handle and resets the internal key pointer.
es: dba_firstkey() devuelve la primera clave de la base de datos especificada por handle y resetea el puntero interno de claves.

source: This permits a linear search through the whole database.
es: Esto permite una busqueda lineal por toda la base de datos.

source: dba_firstkey() returns the key or FALSE depending on whether it succeeds or fails, respectively.
es: dba_firstkey() devuelve la clave o FALSE en funcion de si tiene exito o falla, respectivamente.

source: See also: dba_nextkey() and example 2 in the DBA examples
es: Ver tambien: dba_nextkey()

source: dba_insert() inserts the entry described with key and value into the database specified by handle.
es: dba_insert() inserta la entrada descrita con key y value dentro de la base de datos especificada por handle.

source: It fails, if an entry with the same key already exists.
es: Fallara si ya existe una entrada con el mismo parametro key.

source: key is the key of the entry to be inserted.
es: key es la clave de la entrada a ser insertada.

source: value is the value to be inserted.
es: value es el valor a ser insertado.

source: dba_insert() returns TRUE or FALSE, depending on whether it succeeds of fails, respectively.
es: dba_insert() devuelve TRUE o FALSE, en funcion de si tiene exito o falla, respectivamente.

source: See also: dba_exists() dba_delete() dba_fetch() dba_replace()
es: Ver tambien: dba_exists() dba_delete() dba_fetch() dba_replace()

source: dba_nextkey() returns the next key of the database specified by handle and advances the internal key pointer.
es: dba_nextkey() devuelve la siguiente clave de la base de datos especificada por handle e incrementa el puntero de claves interno.

source: dba_nextkey() returns the key or FALSE depending on whether it succeeds or fails, respectively.
es: dba_nextkey() devuelve la clave o FALSE dependiendo de si tiene exito o falla, respectivamente.

source: See also: dba_firstkey() and example 2 in the DBA examples
es: Ver tambien: dba_firstkey()

source: Use "l" to lock the database with an .lck file or "d "to lock the databasefile itself.
es: dba_open() establece una instancia para path con mode usando handler.

source: If you want to test the access and do not want to wait for the lock you can add "t" as third character.
es: path normalmente es el "path" en el sistema de ficheros.

source: When none of "d", "l" or "-" is used dba will lock on the database file as it would with "d ".
es: mode es "r" para acceso de lectura, "w "para lectura / escritura de una base de datos ya existente, "c" para lectura / escritura y creacion de una base datos si esta no existe, y "n "para crear, truncar y lectura / escritura.

source: dba_open() returns a positive handle or FALSE, in the case the database was opened successfull or fails, respectively.
es: handler es el nombre de el manejador (handler) que sera usado para el acceso al path.

source: When you use dba on a webserver and more than one request requires write operations they can only be done one after another.
es: Es pasado como un parametro opcional a dba_open() y puede usarse en lugar de ella.

source: This is important to know since in such cases locking is simply ignored on the resource and other solutions have to be found.
es: dba_open() devuelve un valor positivo de handler o FALSE, en el caso de que la apertura de la base de datos se realice o si falla, respectivamente.

source: In PHP versions before PHP 4.3.0 you must use semaphores to guard against simultanious database access for any database handler with the exception of GDBM.
es: Ver tambien: dba_popen() dba_close()

source: dba_optimize() optimizes the underlying database specified by handle.
es: dba_optimize() optimiza la base de datos especificada por handle.

source: dba_optimize() returns TRUE or FALSE, if the optimization succeeds or fails, respectively.
es: dba_optimize() devuelve TRUE o FALSE, si la optimizacion tiene exito o falla, respectivamente.

source: See also: dba_sync()
es: Ver tambien: dba_sync()

source: dba_popen() establishes a persistent database instance for path with mode using handler.
es: dba_popen() establece una instancia persistente para path con mode usando handler.

source: path is commonly a regular path in your filesystem.
es: path normalmente es el "path" en el sistema de ficheros.

source: mode is "r" for read access, "w "for read / write access to an already existing database, "c" for read / write access and database creation if it doesn't currently exist, and "n "for create, truncate and read / write access.
es: mode es "r" para acceso de lectura, "w "para lectura / escritura de una base de datos ya existente, "c" para lectura / escritura y creacion de una base datos si esta no existe, y "n "para crear, truncar y lectura / escritura.

source: handler is the name of the handler which shall be used for accessing path.
es: handler es el nombre del manejador (handler) que sera usado para el acceso al path.

source: It is passed all optional parameters given to dba_popen() and can act on behalf of them.
es: Es pasado como un parametro opcional a dba_popen() y puede usarse en lugar de ella.

source: dba_popen() returns a positive handle or FALSE, in the case the open is successful or fails, respectively.
es: dba_popen() devuelve un valor positivo de handler o FALSE, en el caso de que la apertura de la base de datos se realice o si falla, respectivamente.

source: See also: dba_open() dba_close()
es: Ver tambien: dba_open() dba_close()

source: dba_replace() replaces or inserts the entry described with key and value into the database specified by handle.
es: dba_replace() reemplaza o inserta la entrada descrita con key y value dentro de la base de datos especificada por handle.

source: dba_replace() returns TRUE or FALSE, depending on whether it succeeds of fails, respectively.
es: dba_replace() devuelve TRUE o FALSE, dependiendo de si tiene exito o falla respectivamente.

source: See also: dba_exists(), dba_delete(), dba_fetch(), and dba_insert().
es: Ver tambien: dba_exists() dba_delete() dba_fetch() dba_insert()

source: Adds the data in the record to the database.
es: Añade los datos de record a la base de datos.

source: If the number of items in the supplied record isn 't equal to the number of fields in the database, the operation will fail and FALSE will be returned.
es: Si el número de elementos del registro proporcionado no es igual al número de campos de la base de datos, la operación fallará y la función devolverá FALSE.

source: Closes the database associated with dbase_identifier.
es: Cierra el fichero asociado con dbase_identifier.

source: The fields parameter is an array of arrays, each array describing the format of one field in the database.
es: El parámetro fields es un array de arrays, cada uno de los cuales describe el formato de un campo de la base de datos.

source: Each field consists of a name, a character indicating the field type, a length, and a precision.
es: Cada campo consiste de un nombre, un carácter que indica el tipo de campo, una longitud, y una precisión.

source: The types of fields available are:
es: Los tipos de campos disponibles son:

source: Boolean.
es: Lógico.

source: These do not have a length or precision.
es: No tienen longitud ni precisión.

source: Memo. (Note that these aren't supported by PHP.) These do not have a length or precision.
es: Memo. (Sin soporte en PHP.) No tienen longitud ni precisión.

source: Date (stored as YYYYMMDD).
es: Fecha (almacenada como AAAAMMDD).

source: Number.
es: Número.

source: These have both a length and a precision (the number of digits after the decimal point).
es: Tienen longitud y precisión (número de cifras tras el punto decimal).

source: String.
es: Cadena.

source: If the database is successfully created, a dbase_identifier is returned, otherwise FALSE is returned.
es: Si la base de datos se crea con éxito, se devuelve un dbase_identifier; en caso contrario, devuelve FALSE.

source: Creating a dBase database file
es: Crear un fichero dBase

source: Marks record to be deleted from the database.
es: Marca el registro record para ser borrado del fichero de datos.

source: To actually remove the record from the database, you must also call dbase_pack().
es: Para eliminar realmente el registro del fichero, debe llamarse a la función dbase_pack().

source: Returns the data from record in an array.
es: Devuelve los datos del registro record en un array.

source: Each field is converted to the appropriate PHP type, except:
es: El array se indexa a partir de 0, e incluye un elemento con el índice asociativo 'deleted', que vale 1 si el registro ha sido marcado para borrar (ver dbase_delete_record().

source: Integers that would have caused an overflow (32 bits) are returned as strings
es: Cada campo se convierte al tipo PHP apropiado. (Las fechas se guardan como cadenas.)

source: Returns the data from record in an associative array.
es: Devuelve los datos del registro record en un array asociativo.

source: Returns the number of fields (columns) in the specified database.
es: Devuelve el número de campos (columnas) en el fichero especificado.

source: Field numbers are between 0 and dbase_numfields( $db)-1, while record numbers are between 1 and dbase_numrecords($db).
es: Los números de campo va de 0 a dbase_numfields( $db)-1, mientras los números de registros van de 1 a dbase_numrecords($db).

source: Using dbase_numfields()
es: Uso de dbase_numfields()

source: Returns the number of records (rows) in the specified database.
es: Devuelve el número de registros (filas) en el fichero especificado.

source: Record numbers are between 1 and dbase_numrecords( $db), while field numbers are between 0 and dbase_numfields($db )-1.
es: Los números de registro van de 1 a dbase_numrecords( $db), mientras los números de campo van de 0 a dbase_numfields($db )-1.

source: The flags correspond to those for the open() system call. (Typically 0 means read-only, 1 means write-only, and 2 means read and write.)
es: Los "flags" son los que utiliza la llamada al sistema open().

source: When safe mode is enabled, PHP checks whether the files or directories you are about to operate on have the same UID (owner) as the script that is being executed.
es: Devuelve un dbase_identifier del fichero abierto, o FALSE si no pudo abrirse el fichero.

source: Packs the specified database (permanently deleting all records marked for deletion using dbase_delete_record()).
es: Empaqueta el fichero especificado, borrando definitivamente todos los registros marcados con la función dbase_delete_record().

source: Replaces the data associated with the record record_number with the data in the record in the database.
es: Reemplaza los datos asociados con el registro record_number con los datos de record en el fichero de datos.

source: If the number of items in the supplied record is not equal to the number of fields in the database, the operation will fail and FALSE will be returned.
es: Si el número de elementos del registro proporcionado no es igual al número de campos de la base de datos, la operación fallará y la función devolverá FALSE.

source: dbase_record_number is an integer which spans from 1 to the number of records in the database (as returned by dbase_numrecords()).
es: dbase_record_number es un entero en el rango de 1 al número de registros en el fichero de datos (devuelto por la función dbase_numrecords()).

source: DBM Functions [deprecated]
es: Funciones dbm

source: dba_sync() synchronizes the database specified by handle.
es: dba_sync() sincroniza la base de datos especificada por handle.

source: This will probably trigger a physical write to disk, if supported.
es: Esto probablemente realice una escritura fisica en el disco, si es soportado.

source: dba_sync() returns TRUE or FALSE, if the synchronization succeeds or fails, respectively.
es: dba_sync() devuelve TRUE o FALSE, si la sincronizacion tiene exito o falla, respectivamente.

source: See also: dba_optimize()
es: Ver tambien: dba_optimize()

source: [marcus@zaphod marcus]$ php -r'echo dblist(); 'This is GDBM version 1.8.0, as of May 19, 1999.
es: Descripción string dblist (void)

source: Unlocks and closes the specified database.
es: Desbloquea y cierra la base de datos especificada.

source: Deletes the value for key in the database.
es: Borra el valor para la clave en la base de datos.

source: Returns FALSE if the key didn 't exist in the database.
es: Devuelve FALSE si la clave no existía en la base de datos.

source: Returns TRUE if there is a value associated with the key.
es: Devuelve TRUE si hay un valor asociado con la clave.

source: Returns the value associated with key.
es: Devuelve el valor asociado con la clave.

source: Returns the first key in the database.
es: Devuelve la primera clave de la base de datos.

source: Note that no particular order is guaranteed since the database may be built using a hash-table, which doesn 't guarantee any ordering.
es: Nótese que no se garantiza ningún orden en particular, pues la base de datos se crea utilizando una tabla hash, que no garantiza ordenación alguna.

source: Adds the value to the database with the specified key.
es: Añade el valor a la base de datos con la clave especificada.

source: Returns -1 if the database was opened read-only, 0 if the insert was successful, and 1 if the specified key already exists. (To replace the value, use dbmreplace().)
es: Devuelve -1 si la base de datos se abrío en modo sólo lectura, 0 si la inserción tuvo éxito y 1 si la clave ya existía (para sustituir el valor, utilice dbmreplace().)

source: Returns the next key after key.
es: Devuelve la clave que sigue a clave.

source: By calling dbmfirstkey() followed by successive calls to dbmnextkey() it is possible to visit every key / value pair in the dbm database.
es: Llamando a dbmfirstkey() seguida de llamadas sucesivas a dbmnextkey() se pueden visitar todos los pares clave / valor de la base de datos dbm.

source: Visiting every key / value pair in a DBM database
es: Visitanco cada par clave / valor en una base de datos dbm.

source: $key = dbmfirstkey ($dbm_id); while ($key) {echo "$key = ". dbmfetch ($dbm_id, $key). "\n"; $key = dbmnextkey ($dbm_id, $key);}
es: $clave = dbmfirstkey( $id_dbm); while ($clave) {echo "$clave = ". dbmfetch($id_dbm, $clave). "\n"; $clave = dbmnextkey($id_dbm, $clave);}

source: The first argument is the full-path filename of the DBM file to be opened and the second is the file open mode which is one of "r", "n", "c" or "w "for read-only, new (implies read-write, and most likely will truncate an already-existing database of the same name), create (implies read-write, and will not truncate an already-existing database of the same name) and read-write respectively.
es: El primer argumento es el nombre con sendero completo del archivo dbm que se va a abrir y el segundo es el modo de apertura, que puede ser "r", "n", "c" o "w", que significan sólo lectura, nuevo (implica lectura / escritura y suele truncar una base de datos si ya existía con ese nombre), crear (implica lectura / escritura, pero sin truncar la base de datos) y abrir para lectura / escritura, respectivamente.

source: Returns an identifier to be passed to the other DBM functions on success, or FALSE on failure.
es: Devuelve un identificador que se pasa al resto de funciones dbm si tiene éxito, o FALSE si falla.

source: GDBM only uses one file, as does the internal flat-file support, and Berkeley DB creates a filename.db file.
es: Si se utiliza el soporte de ndbm, este creará los archivos fichero.dir y fichero.pag. gdbm sólo utiliza un archivo y lo mismo hace el soporte interno de archivos de texto, mientras que el db de Berkeley crea un archivo fichero.db.

source: PHP does not delete the .lck files it creates.
es: Nótese que el PHP hace su propio bloqueo de archivo sobre el que pudiera realizar la propia librería dbm.

source: It uses these files simply as fixed inodes on which to do the file locking.
es: El PHP no borra los archivos .lck que crea.

source: For more information on DBM files, see your Unix man pages, or obtain GNU 's GDBM.
es: Los utiliza simplemente como i-nodos fijos en los que hacer el bloqueo.

source: Replaces the value for the specified key in the database.
es: Sustituye el valor para la clave especificada de la base de datos.

source: This will also add the key to the database if it didn 't already exist.
es: También añadirá la clave a la base de datos si no existía antes.

source: Example 1. dbx_close() example
es: Ejemplo 1. dbx_close() example

source: Example 1. dbx_compare() example
es: Ejemplo 1. dbx_compare() example

source: Example 1. dbx_connect() example
es: Ejemplo 1. dbx_connect() example

source: Example 1. dbx_error() example
es: Ejemplo 1. dbx_error() example

source: Example 1. dbx_escape_string() example
es: Ejemplo 1. dbx_escape_string() example

source: Example 2. lists each field 's name and type
es: Ejemplo 2. lists each field 's name and type

source: Example 3. outputs the content of data property into HTML table
es: Ejemplo 3. outputs the content of data property into HTML table

source: Example 1. dbx_sort() example
es: Ejemplo 1. dbx_sort() example

source: This function allows you to override the current domain for a single message lookup.
es: Esta función permite omitir el dominio actual para una busqueda de un mensaje.

source: It also allows you to specify a category.
es: Además permite especificar una categoría.

source: Example 1. debug_backtrace() example
es: Ejemplo 1. debug_backtrace() example

source: This function is only available in PHP 3.
es: Deshabilita el depurador interno de PHP.

source: For more information see the appendix on Debugging PHP.
es: El depurador está aún en desarrollo.

source: Returns a string containing a binary representation of the given number argument.
es: Devuelve una cadena conteniendo la representación en binario de el número dado en el argumento.

source: The largest number that can be converted is 4294967295 in decimal resulting to a string of 32 1 's.
es: El número mayor que puede ser convertido es 2147483647 en decimal que resulta una cadena de 31 unos.

source: See also: bindec().
es: Vea también la función bindec().

source: Returns a string containing a hexadecimal representation of the given number Returns a string containing a hexadecimal representation of the given number argument.
es: Devuelve una cadena conteniendo la representación hexadecimal del número dado en el argumento.

source: The largest number that can be converted is 2147483647 in decimal resulting to "7fffffff".
es: El mayor número que puede ser convertido es 2147483647 en decimal resultando "7fffffff".

source: See also hexdec().
es: Vea también la función hexdec().

source: Returns a string containing an octal representation of the given number argument.
es: Devuelve una cadena conteniendo la representación octal del número dado en el argumento.
